// Массивы с днями недели
const shortNameDay = ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Суб"];
const nameDay = [
  "Воскресенье",
  "Понедельник",
  "Вторник",
  "Среда",
  "Четверг",
  "Пятница",
  "Суббота",
];

const groupArray = [
  "ИБТС-211",
  "РСК-211"
];

const buttonDaySelecter = [
  { name: "Понедельник", data: 1 },
  { name: "Вторник", data: 2 },
  { name: "Среда", data: 3 },
  { name: "Четверг", data: 4 },
  { name: "Пятница", data: 5 },
  { name: "Суббота", data: 6 },
];

const regex = /^(\d{2}:\d{2})-(\d{2}:\d{2})\s+(.+?)\s+\((Л|Лаб|Пр)\),\s*(.+?),\s*Ауд\.\s*(.+)\s*$/;

const buttonNameWeekDay = ["Числитель", "Знаменатель"];

// DOM-элементы
const shower = document.getElementById("listInfo");
const selecterName = document.getElementById("selecterName");
const overlay = document.getElementById("overlay");
const selecterDay = document.getElementById("selecterDay");
const addToHomeScreen = document.getElementById("addToHomeScreen");
const topBar = document.getElementById('today_naming');
let lastSelectedDay = 1;  // последняя выбранная дата

function cleanMainScreen() {
  shower.textContent = "";
}

function topBarSetText(text) {
  topBar.innerHTML = text;
}

const schedulejson = {
  "ИБТС-211": {
    Понедельник: {
      Числитель:
        "08:30-10:00 Системы документальной электросвязи (Л), старший преподаватель Ермакова Н.Н., Ауд. 2-06 М<br>10:10-11:40 Сети и системы радиосвязи (Пр), старший преподаватель Пономарев И.Н., Ауд. 3-15 К<br>12:00-13:30 Сети и системы радиосвязи (Л), старший преподаватель Пономарев И.Н., Ауд. 2-01 К<br>13:40-15:10 Защита информации от утечки по техническим каналам (Лаб), доцент Стебенькова Н.А., Ауд. 2-06 М",
      Знаменатель:
        "08:30-10:00 Программно-аппаратные средства защиты информации (Пр), ассистент Бушнева М.А., Ауд. 2-04 К<br>10:10-11:40 Сети и системы радиосвязи (Пр), старший преподаватель Пономарев И.Н., Ауд. 3-15 К<br>12:00-13:30 Сети и системы радиосвязи (Л), старший преподаватель Пономарев И.Н., Ауд. 2-01 К<br>13:40-15:10 Защита информации от утечки по техническим каналам (Лаб), доцент Стебенькова Н.А., Ауд. 2-06 М",
    },

    Вторник: {
      Числитель:
        "12:00-13:30 Системы документальной электросвязи (Пр), старший преподаватель Ермакова Н.Н., Ауд. 2-06 М<br>13:40-15:10 Безопасность виртуальной среды (Пр), ассистент Дмитриенко Н.Р., Ауд. 2-17 М<br>15:20-16:50 Защита информации от утечки по техническим каналам (Л), доцент Стебенькова Н.А., Ауд. 2-13 М<br>17:00-18:30 Защита информации от утечки по техническим каналам (Пр), доцент Стебенькова Н.А., Ауд. 2-13 М",
      Знаменатель:
        "12:00-13:30 Системы документальной электросвязи (Пр), старший преподаватель Ермакова Н.Н., Ауд. 2-06 М<br>13:40-15:10 Системы документальной электросвязи (Л), старший преподаватель Ермакова Н.Н., Ауд. 2-13 М<br>15:20-16:50 Защита информации от утечки по техническим каналам (Л), доцент Стебенькова Н.А., Ауд. 2-13 М<br>17:00-18:30 Защита информации от утечки по техническим каналам (Пр), доцент Стебенькова Н.А., Ауд. 2-13 М",
    },

    Среда: "",

    Четверг: {
      Числитель:
        "08:30-10:00 Безопасность виртуальной среды (Лаб), ассистент Дмитриенко Н.Р., Ауд. 2-06 М<br>10:10-11:40 Безопасность виртуальной среды (Лаб), ассистент Дмитриенко Н.Р., Ауд. 2-06 М",
      Знаменатель:
        "08:30-10:00 Волоконно-оптические линии связи (Пр), ассистент Гладков И.Ф., Ауд. 2-17 М<br>10:10-11:40 Безопасность виртуальной среды (Л), Дмитриенко Н.Р., Ауд. 2-17 М",
    },

    Пятница:
      "12:00-13:30 Сети и системы радиосвязи (Лаб), старший преподаватель Пономарев И.Н., Ауд. 3-15 К<br>13:40-15:10 Программно-аппаратные средства защиты информации (Лаб), ассистент Бушнева М.А., Ауд. 3-28 К<br>15:20-16:50 Программно-аппаратные средства защиты информации (Л), старший преподаватель Жуйков Е.А., Ауд. Акт. зал К<br>17:00-18:30 Производственная практика, научно-исследовательская работа (Пр), доцент Арепьева Е.Е., Ауд. 3-16 К",

    Суббота:
      "10:10-11:40 Волоконно-оптические линии связи (Л), доцент Чадаев Д.И., Ауд. 2-13 М<br>12:00-13:30 Волоконно-оптические линии связи (Лаб), ассистент Гладков И.Ф., Ауд. 1-19 М",
  },

  // Оставляю вторую группу как была — при необходимости тоже перепишу
  "РСК-211": {
    Вторник:
      "12:00-13:30 Сети и системы радиосвязи (Лаб), старший преподаватель Тюхтяев Д.А., Ауд. 3-15а К<br>13:40-15:10 Системы коммутаций (Лаб), доцент Сафонова О.Е., Ауд. 3-15б К<br>15:20-16:50 Теория телетрафика (Л), старший преподаватель Тюхтяев Д.А., Ауд. 3-26 К",
    Среда: {
      Числитель:
        "13:40-15:10 <br>15:20-16:50 Устройства генерирования и формирования сигналов (Л), старший преподаватель Пономарев И.Н., Ауд. 2-01 К<br>17:00-18:30 Устройства приема и преобразования сигналов (Л), старший преподаватель Пономарев И.Н., Ауд. 2-30 К",
      Знаменатель:
        "13:40-15:10 Устройства генерирования и формирования сигналов (Лаб), старший преподаватель Пономарев И.Н., Ауд. 3-15 К<br>15:20-16:50 Устройства генерирования и формирования сигналов (Л), старший преподаватель Пономарев И.Н., Ауд. 2-01 К<br>17:00-18:30 Устройства приема и преобразования сигналов (Л), старший преподаватель Пономарев И.Н., Ауд. 2-30 К",
    },
    Четверг: {
      Числитель:
        "12:00-13:30 Основы теории нечеткого управления в радиосистемах (Пр),  старший преподаватель Безбожнов О.Н., Ауд. 2-13 М<br>13:40-15:10 Факультатив: Основы робототехники (Лаб),  старший преподаватель Безбожнов О.Н., Ауд. 2-13а М<br>15:20-16:50 Сети и системы радиосвязи (Л), старший преподаватель Пономарев И.Н., Ауд. 2-30 К<br>17:00-18:30 Устройства приема и преобразования сигналов (Лаб), старший преподаватель Пономарев И.Н., Ауд. 3-15 К",
      Знаменатель:
        "12:00-13:30 Основы теории нечеткого управления в радиосистемах (Пр),  старший преподаватель Безбожнов О.Н., Ауд. 2-13 М<br>13:40-15:10 Системы коммутаций (Л), доцент Семенов Е.С., Ауд. 2-30 К<br>15:20-16:50 Сети и системы радиосвязи (Л), старший преподаватель Пономарев И.Н., Ауд. 2-30 К<br>17:00-18:30 Устройства приема и преобразования сигналов (Лаб), старший преподаватель Пономарев И.Н., Ауд. 3-15 К",
    },
    Пятница: {
      Числитель:
        "15:20-16:50 Теория телетрафика (Лаб), старший преподаватель Тюхтяев Д.А., Ауд. 2-13а М<br>17:00-18:30 Теория телетрафика (Лаб), старший преподаватель Тюхтяев Д.А., Ауд. 2-13а М",
      Знаменатель:
        "15:20-16:50 Производственная практика, научно-исследовательская работа (Пр), доцент Арепьева Е.Е., Ауд. 2-13а М<br>17:00-18:30 Производственная практика, научно-исследовательская работа (Пр), доцент Арепьева Е.Е., Ауд. 2-13а М",
    },
  },
};
